In [34]:
import pandas as pd
import numpy as np
 
    
# intialise data of lists.
data = {'Name':['Tom', 'nick', 'krish', 'jack',"","","ae"],
        'Age':[20, 21, 19, 18,np.nan,23,9]}
 
    
print(type(data))    
# Create DataFrame
df = pd.DataFrame(data)
print(type(df))
# Print the output.
print(df)

<class 'dict'>
<class 'pandas.core.frame.DataFrame'>
    Name   Age
0    Tom  20.0
1   nick  21.0
2  krish  19.0
3   jack  18.0
4          NaN
5         23.0
6     ae   9.0

In [22]:
df

    Name   Age
0    Tom  20.0
1   nick  21.0
2  krish  19.0
3   jack  18.0
4          NaN
5         23.0
6     ae   9.0

In [23]:
df.isna().sum()

Name    0
Age     1
dtype: int64

In [24]:
df.isnull().sum()

Name    0
Age     1
dtype: int64

In [26]:
df.dropna()

    Name   Age
0    Tom  20.0
1   nick  21.0
2  krish  19.0
3   jack  18.0
5         23.0
6     ae   9.0

In [28]:
#svfgfd
df.dtypes

Name     object
Age     float64
dtype: object

In [31]:
df.dropna(axis=0,subset=["Age"],inplace=True)

In [32]:
df

    Name   Age
0    Tom  20.0
1   nick  21.0
2  krish  19.0
3   jack  18.0
5         23.0
6     ae   9.0

In [43]:
df2=df.Age.fillna(0)

In [47]:
df["Age"]=df2

In [48]:
df

    Name   Age
0    Tom  20.0
1   nick  21.0
2  krish  19.0
3   jack  18.0
4          0.0
5         23.0
6     ae   9.0